app/controllers/api/carbon_dioxides_controller.rb

  def index
    @carbon_dioxides = CarbonDioxide.all
---
SELECT "carbon_dioxides".* FROM "carbon_dioxides"

  def create
    @carbon_dioxide = CarbonDioxide.new(carbon_dioxide_params)


      if @carbon_dioxide.save
---
INSERT INTO "carbon_dioxides" ("dataDioxide", "node_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["dataDioxide", 20.0], ["node_id", 1], ["created_at", 2017-05-04 15:56:08 UTC], ["updated_at", 2017-05-04 15:56:08 UTC]]