app/controllers/api/carbon_monoxides_controller.rb

SELECT "carbon_monoxides".* FROM "carbon_monoxides"
---
  def index
    @carbon_monoxides = CarbonMonoxide.all

INSERT INTO "carbon_monoxides" ("dataMonoxide", "node_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["dataMonoxide", 10000.0], ["node_id", 1], ["created_at", 2017-05-04 15:09:21 UTC], ["updated_at", 2017-05-04 15:09:21 UTC]]
---
  def create
    @carbon_monoxide = CarbonMonoxide.new(carbon_monoxide_params)

      if @carbon_monoxide.save