app/controllers/api/temperatures_controller.rb

  def create
    @temperature = Temperature.new(temperature_params)

      if @temperature.save
---
INSERT INTO "temperatures" ("dateTemperature", "node_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["dateTemperature", 21.0], ["node_id", 1], ["created_at", 2017-05-31 22:48:42 UTC], ["updated_at", 2017-05-31 22:48:42 UTC]]