airescue/app/controllers/api/carbons_controller.rb

SELECT "carbons".* FROM "carbons"
---
  def index
    @carbons = Carbon.all

INSERT INTO "carbons" ("dataCarbon", "node_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["dataCarbon", 18.0], ["node_id", 1], ["created_at", 2017-05-04 14:17:10 UTC], ["updated_at", 2017-05-04 14:17:10 UTC]]
---
  def create
    @carbon = Carbon.new(carbon_params)

      if @carbon.save