airescue/app/controllers/api/humidities_controller.rb

  def index
    @humidities = Humidity.all
---
SELECT "humidities".* FROM "humidities"

  def create
    @humidity = Humidity.new(humidity_params)

      if @humidity.save
---
INSERT INTO "humidities" ("dataHumidity", "node_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["dataHumidity", 20.0], ["node_id", 1], ["created_at", 2017-05-04 15:37:38 UTC], ["updated_at", 2017-05-04 15:37:38 UTC]]