airescue/app/controllers/api/nodes_controller.rb

SELECT "nodes".* FROM "nodes"
---
  def index
    @nodes = Node.all