airescue/app/controllers/api/ozones_controller.rb

SELECT "ozones".* FROM "ozones"
---
  def index
    @ozones = Ozone.all

INSERT INTO "ozones" ("dataOzone", "node_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["dataOzone", 987.0], ["node_id", 1], ["created_at", 2017-05-11 07:57:43 UTC], ["updated_at", 2017-05-11 07:57:43 UTC]]
---
  def create
    @ozone = Ozone.new(ozone_params)

      if @ozone.save