airescue/app/controllers/api/temperatures_controller.rb

SELECT "temperatures".* FROM "temperatures"
---
  def index
    @temperatures = Temperature.all

INSERT INTO "temperatures" ("dateTemperature", "node_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["dateTemperature", 18.0], ["node_id", 1], ["created_at", 2017-05-04 13:26:05 UTC], ["updated_at", 2017-05-04 13:26:05 UTC]]
---
  def create
    @temperature = Temperature.new(temperature_params)

      if @temperature.save