airescue/app/controllers/carbons_controller.rb

SELECT "carbons".* FROM "carbons"
---
  def index
    @carbons = Carbon.all

DELETE FROM "carbons" WHERE "carbons"."id" = $1  [["id", 1]]
---
  def destroy
    @carbon.destroy

SELECT  "carbons".* FROM "carbons" WHERE "carbons"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_carbon
      @carbon = Carbon.find(params[:id])