airescue/app/controllers/carbon_dioxides_controller.rb

SELECT "carbon_dioxides".* FROM "carbon_dioxides"
---
  def index
    @carbon_dioxides = CarbonDioxide.all

INSERT INTO "carbon_dioxides" ("dataDioxide", "node_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["dataDioxide", 10.3], ["node_id", 1], ["created_at", 2017-05-04 15:47:10 UTC], ["updated_at", 2017-05-04 15:47:10 UTC]]
---
  def create
    @carbon_dioxide = CarbonDioxide.new(carbon_dioxide_params)

    respond_to do |format|
      if @carbon_dioxide.save

SELECT  "carbon_dioxides".* FROM "carbon_dioxides" WHERE "carbon_dioxides"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_carbon_dioxide
      @carbon_dioxide = CarbonDioxide.find(params[:id])