airescue/app/controllers/graphics_controller.rb

SELECT  "nodes".* FROM "nodes" WHERE "nodes"."id" IN (SELECT "temperatures"."id" FROM "temperatures" WHERE "temperatures"."node_id" = $1) LIMIT $2  [["node_id", 1], ["LIMIT", 1]]
SELECT "temperatures".* FROM "temperatures" WHERE "temperatures"."node_id" = $1  [["node_id", 1]]
SELECT "carbon_dioxides".* FROM "carbon_dioxides" WHERE "carbon_dioxides"."node_id" = $1  [["node_id", 1]]
SELECT "carbon_monoxides".* FROM "carbon_monoxides" WHERE "carbon_monoxides"."node_id" = $1  [["node_id", 2]]
SELECT "ozones".* FROM "ozones" WHERE "ozones"."node_id" = $1  [["node_id", 2]]
SELECT "humidities".* FROM "humidities" WHERE "humidities"."node_id" = $1  [["node_id", 1]]
---
    def show
        @nombre = Node.find_by(id: params[:id]).name
        @temp = Temperature.where(node_id: params[:id])
        @dioxide = CarbonDioxide.where(node_id: params[:id])
        @monoxide = CarbonMonoxide.where(node_id: params[:id])
        @ozone = Ozone.where(node_id: params[:id])
        @humed = Humidity.where(node_id: params[:id])