airescue/app/controllers/graphics_controller.rb

SELECT  "temperatures".* FROM "temperatures" ORDER BY "temperatures"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
    def index
        @temperatures = Temperature.all