airescue/app/controllers/nodes_controller.rb

  def index
    @nombreNodes = "AiRescue"
    @nodes = Node.all
---
SELECT "nodes".* FROM "nodes"

  def show
    @dioxide = CarbonDioxide.where(node_id: params[:id]).last
    @monoxide = CarbonMonoxide.where(node_id: params[:id]).last
    @ozone = Ozone.where(node_id: params[:id]).last
    @humed = Humidity.where(node_id: params[:id]).last
    @temp = Temperature.where(node_id: params[:id]).last
---
SELECT  "carbon_dioxides".* FROM "carbon_dioxides" WHERE "carbon_dioxides"."node_id" = $1 ORDER BY "carbon_dioxides"."id" DESC LIMIT $2  [["node_id", 1], ["LIMIT", 1]]
SELECT  "carbon_monoxides".* FROM "carbon_monoxides" WHERE "carbon_monoxides"."node_id" = $1 ORDER BY "carbon_monoxides"."id" DESC LIMIT $2  [["node_id", 1], ["LIMIT", 1]]
SELECT  "ozones".* FROM "ozones" WHERE "ozones"."node_id" = $1 ORDER BY "ozones"."id" DESC LIMIT $2  [["node_id", 1], ["LIMIT", 1]]
SELECT  "humidities".* FROM "humidities" WHERE "humidities"."node_id" = $1 ORDER BY "humidities"."id" DESC LIMIT $2  [["node_id", 1], ["LIMIT", 1]]
SELECT  "temperatures".* FROM "temperatures" WHERE "temperatures"."node_id" = $1 ORDER BY "temperatures"."id" DESC LIMIT $2  [["node_id", 1], ["LIMIT", 1]]

  def create
    @node = Node.new(node_params)

    respond_to do |format|
      if @node.save
---
INSERT INTO "nodes" ("name", "address", "description", "data", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Yeison"], ["address", "Mi casa"], ["description", "Hola Mari :)"], ["data", 5.0], ["created_at", 2017-05-01 19:12:59 UTC], ["updated_at", 2017-05-01 19:12:59 UTC]]

  def update
    respond_to do |format|
      if @node.update(node_params)
---
UPDATE "nodes" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "nodes"."id" = $4  [["name", "EAFIT"], ["description", "aadadadad"], ["updated_at", 2017-05-11 07:32:46 UTC], ["id", 1]]

  def destroy
    @node.destroy
---
DELETE FROM "nodes" WHERE "nodes"."id" = $1  [["id", 11]]

    def set_node
      @node = Node.find(params[:id])
---
SELECT  "nodes".* FROM "nodes" WHERE "nodes"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]