airescue/app/controllers/ozones_controller.rb

SELECT "ozones".* FROM "ozones"
---
  def index
    @ozones = Ozone.all

INSERT INTO "ozones" ("dataOzone", "node_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["dataOzone", 10.3], ["node_id", 1], ["created_at", 2017-05-04 17:52:10 UTC], ["updated_at", 2017-05-04 17:52:10 UTC]]
---
  def create
    @ozone = Ozone.new(ozone_params)

    respond_to do |format|
      if @ozone.save

SELECT  "ozones".* FROM "ozones" WHERE "ozones"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_ozone
      @ozone = Ozone.find(params[:id])