airescue/app/views/graphics/index.html.erb

        data.addColumn('number', 'Grados');
        data.addRows([
          <% @temperatures.each do |temperature|%>
          ['<%= temperature.created_at.strftime("%H:00")%>', <%= temperature.dateTemperature.to_int%>],
          <%end%>
          ]);
        // Set chart options
        var options = {'title':'Reporte diario Nodo <%= Node.find_by(id: Temperature.where(node_id:1)).name%>',
                       'width':400,
                       'height':300,
                       hAxis: {title: 'Tiempo'},
                       vAxis: {title: 'Grados'}};
---
SELECT  "temperatures".* FROM "temperatures" ORDER BY "temperatures"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT  "nodes".* FROM "nodes" WHERE "nodes"."id" IN (SELECT "temperatures"."id" FROM "temperatures" WHERE "temperatures"."node_id" = $1) LIMIT $2  [["node_id", 1], ["LIMIT", 1]]