app/controllers/carbon_monoxides_controller.rb

SELECT "carbon_monoxides".* FROM "carbon_monoxides"
---
  def index
    @carbon_monoxides = CarbonMonoxide.all