app/controllers/humidities_controller.rb

SELECT "humidities".* FROM "humidities"
---
  def index
    @humidities = Humidity.all

INSERT INTO "humidities" ("dataHumidity", "node_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["dataHumidity", 14.3], ["node_id", 1], ["created_at", 2017-05-04 15:26:35 UTC], ["updated_at", 2017-05-04 15:26:35 UTC]]
---
  def create
    @humidity = Humidity.new(humidity_params)

    respond_to do |format|
      if @humidity.save

SELECT  "humidities".* FROM "humidities" WHERE "humidities"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_humidity
      @humidity = Humidity.find(params[:id])