app/controllers/temperatures_controller.rb

  def index
    @temperatures = Temperature.all
---
SELECT "temperatures".* FROM "temperatures"

  def create
    @temperature = Temperature.new(temperature_params)

    respond_to do |format|
      if @temperature.save
---
INSERT INTO "temperatures" ("dateTemperature", "node_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["dateTemperature", 12.9], ["node_id", 1], ["created_at", 2017-05-04 13:21:22 UTC], ["updated_at", 2017-05-04 13:21:22 UTC]]

  def destroy
    @temperature.destroy
---
DELETE FROM "temperatures" WHERE "temperatures"."id" = $1  [["id", 3]]

    def set_temperature
      @temperature = Temperature.find(params[:id])
---
SELECT  "temperatures".* FROM "temperatures" WHERE "temperatures"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]